### Q1. List any five functions of the pandas library with execution.

In [7]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [9]:
# it will fetch first 3 rows from data set
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
# it will fetch last 3 rows from data set
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [13]:
# it will fetch perticular columns
df[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [15]:
# it will give the description of data set
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [21]:
# it will give column names
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
df.memory_usage()

Index           128
PassengerId    7128
Survived       7128
Pclass         7128
Name           7128
Sex            7128
Age            7128
SibSp          7128
Parch          7128
Ticket         7128
Fare           7128
Cabin          7128
Embarked       7128
dtype: int64

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [31]:
import pandas as pd
def reindex_df(df):
    new_index = pd.RangeIndex(start=1, stop=df.shape[0]*2, step=2)
    df = df.reindex(new_index)
    return df

In [33]:
data ={'A': [10,20,30,40],'B':[50,60,70,80], 'C':[90,100,110,120] }
df = pd.DataFrame(data)

## original dataframe
print("Original DataFrame:\n", df)
print("--------------------------")
## reindexed dataframe
df = reindex_df(df)
print("Reindexed DataFrame:\n", df)

Original DataFrame:
     A   B    C
0  10  50   90
1  20  60  100
2  30  70  110
3  40  80  120
--------------------------
Reindexed DataFrame:
       A     B      C
1  20.0  60.0  100.0
3  40.0  80.0  120.0
5   NaN   NaN    NaN
7   NaN   NaN    NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. 
### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
### calculate and print the sum of the first three values, which is 60.

In [35]:
import pandas as pd

def sum_first_three_values(df):
    sum_values = 0
    for i in range(3):
        sum_values += df.at[i, 'Values']
    print("Sum of first three value: ", sum_values)

data = {'Values': [10,20,30,40,50]}
df = pd.DataFrame(data)

## print the original dataframe
print("Original DataFrame: \n", df)

Original DataFrame:
    Values
0      10
1      20
2      30
3      40
4      50

In [36]:
sum_first_three_values(df)

Sum of first three value:  60

In [37]:
pd.DataFrame(data)

   Values
0      10
1      20
2      30
3      40
4      50

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column Word_Count' that contains the number of words in each row of the 'Text' column.

In [38]:
import pandas as pd
def add_word_count(df):
    df['Word_count'] = df['Text'].apply(lambda x: len(str(x).split()))
    return df
    
    
data = {'Text' : ['Hello, world!', 'This is learning journey', 'Welcome to learn Python panadas']}
df = pd.DataFrame(data)

# print original dataframe
print("Original DataFrame: \n", df)

Original DataFrame:
                               Text
0                    Hello, world!
1         This is learning journey
2  Welcome to learn Python panadas

In [40]:
## cal function to add 'Word_count' column
df = add_word_count(df)
print("DataFrame with Word_count column: \n",df)

DataFrame with Word_count column:
                               Text  Word_count
0                    Hello, world!           2
1         This is learning journey           4
2  Welcome to learn Python panadas           5

### Q5. How are DataFrame.size() and DataFrame.shape() different?

Both DataFrame.size() and DataFrame.shape() are methods in Pandas DataFrame that provide information about the dimensions of the DataFrame, but they have different meanings:

DataFrame.shape() 
    returns a tuple representing the dimensions of the DataFrame as (number of rows, number of columns). For    example, a DataFrame with 5 rows and 3 columns would have a shape of (5, 3).

DataFrame.size() 
    returns the total number of elements in the DataFrame, which is the product of the number of rows and columns. In other words, it returns the total number of cells in the DataFrame. For example, a DataFrame with 5 rows and 3 columns would have a size of 15.

In [ ]:
import pandas as pd

data = {'name': ['Alice', 'Bob', 'Charlie'], 'age': [25, 30, 35], 'gender': ['F', 'M', 'M']}
df = pd.DataFrame(data)

print(df.shape)  # Output: (3, 3)
print(df.size)   # Output: 9

In [2]:
import pandas as pd
data = {'name': ['Charlie', 'king', 'queen'], 'age': [20,30,35], 'gender': ['F','M','F']}
df = pd.DataFrame(data)

print(df.shape)
print(df.size)

(3, 3)
9

### Q6. Which function of pandas do we use to read an excel file?

In Pandas, we can use the read_excel() function to read data from an Excel file.

import pandas as pd

df = pd.read_excel('file_name.xlsx')

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [ ]:
import pandas as pd

def extract_username(df, email_column_name='Email' , username_column_name= 'Username'):
    
    # Extract the username part from each email address using a regular expression
    df[username_column_name] = df[email_column_name].str.extract(r'^([a-zA-Z0-9._%+-]+)@')
    
    return df


data = {'Email': ['john.doe@example.com', 'jane.doe@example.com', 'jimmy@example.com']}
df= pd.DataFrame(data)
df = extract_username(df)
print(df)

                  Email  Username
0  john.doe@example.com  john.doe
1  jane.doe@example.com  jane.doe
2     jimmy@example.com     jimmy

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
####   A B C
#### 0 3 5 1
#### 1 8 2 7
#### 2 6 9 4
#### 3 2 3 5
#### 4 9 1 2

In [ ]:
def select_rows(df):
    selected_rows = df[(df['A']> 5) & (df['B'] < 10)]
    return selected_rows


data = {'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)

selected_rows = select_rows(df)
print(selected_rows)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [22]:
values = [10,20,30,40,50]
df = pd.DataFrame({'Values':values})
print(df)

   Values
0      10
1      20
2      30
3      40
4      50

In [23]:
import pandas as pd
def calculate_states(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean, median, std

In [24]:
mean, median , std =calculate_states(df)
print(f"mean:{mean}, median:{median}, Standard Deviation:{std}")

mean:30.0, median:30.0, Standard Deviation:15.811388300841896

### Q10. create a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [57]:
import pandas as pd

def calculate_moving_average(df):
    ma_window = 7  # window size for moving average calculation
    ma_column = 'MovingAverage'  # name of the new moving average column
    
    # calculate the moving average using a rolling window of size ma_window
    ma = df['Sales'].rolling(window=ma_window, min_periods=1).mean()
    
    # add the moving average column to the DataFrame
    df[ma_column] = ma
    
    return df

In [58]:
# create a DataFrame with a column 'Sales' and a column 'Date'
data = {'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
        'Date': pd.date_range(start='2022-01-01', periods=10)}

df = pd.DataFrame(data)

# calculate the moving average and add it as a new column
df = calculate_moving_average(df)

# print the DataFrame
print(df)

   Sales       Date  MovingAverage
0     10 2022-01-01           10.0
1     20 2022-01-02           15.0
2     30 2022-01-03           20.0
3     40 2022-01-04           25.0
4     50 2022-01-05           30.0
5     60 2022-01-06           35.0
6     70 2022-01-07           40.0
7     80 2022-01-08           50.0
8     90 2022-01-09           60.0
9    100 2022-01-10           70.0

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
#### Date
#### 0 2023-01-01
#### 1 2023-01-02
#### 2 2023-01-03
#### 3 2023-01-04
#### 4 2023-01-05
#### Your function should create the following DataFrame:

#### Date Weekday
#### 0 2023-01-01 Sunday
#### 1 2023-01-02 Monday
#### 2 2023-01-03 Tuesday
#### 3 2023-01-04 Wednesday
#### 4 2023-01-05 Thursday
#### The function should return the modified DataFrame.

In [4]:
import pandas as pd

def add_weekday_column(df):
    # convert the 'Date' column to a pandas datetime object
    df['Date'] = pd.to_datetime(df['Date'])
    
    # create a new column 'Weekday' containing the weekday name
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

In [5]:
# create a DataFrame with a 'Date' column
data = {'Date': pd.date_range(start='2023-01-01', periods=5)}

df = pd.DataFrame(data)

# add the 'Weekday' column
df = add_weekday_column(df)

# print the DataFrame
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [6]:
import pandas as pd
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [7]:
data = {'Date':pd.date_range(start='2023-01-01', periods=5)}
df = pd.DataFrame(data)
print(df)
df = add_weekday_column(df)
print(df)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [8]:
import pandas as pd

def select_rows_between_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df.loc[mask]
    return selected_rows

In [11]:
selected_rowss =   select_rows_between_dates(df)
selected_rowss

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday